      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SENTENCES.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "This program contains four DIVISIONS,"
            DISPLAY "three PARAGRAPHS".
            DISPLAY "and four SENTENCES".
       PROGRAM-DONE.                                                    MB072197
            STOP RUN.
       END PROGRAM SENTENCES.
      *Example tag                                THIS IS A TAG--->     MB072198
