        IDENTIFICATION DIVISION.
        PROGRAM-ID. MINIMUM.
        ENVIRONMENT DIVISION.
        DATA DIVISION.
        PROCEDURE DIVISION.

        PROGRAM-DONE.
            STOP RUN.
