      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. STRUCTURE.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Run Program".
            PERFORM SAY-HELLO.
            STOP RUN.

       SAY-HELLO.
           DISPLAY "Hello All".
       END PROGRAM STRUCTURE.
