      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  ALPHA  PICTURE IS XXX.
       01  BETA PIC X(200).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "INPUT ALPHA".
            ACCEPT ALPHA.
            DISPLAY ALPHA.
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
